Revit 2026 API

# RebarShapeDefinitionRemoveParameter Method

---

Remove the parameter from the definition.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveParameter(
	ElementId paramId
)
```
```vb
Public Sub RemoveParameter (
	paramId As ElementId
)
```
```cpp
public:
void RemoveParameter(
	ElementId^ paramId
)
```
```fsharp
member RemoveParameter :
        paramId : ElementId -> unit
```

#### Parameters

paramId ElementId
     Id of a parameter in the definition.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If the definition does not have the parameter, the method does nothing.

#### Reference

RebarShapeDefinition Class

Autodesk.Revit.DB.Structure Namespace